Revit 2026 API

# IFCCategoryTemplateSetMappingInfo(IDictionaryExportIFCCategoryKey, ExportIFCCategoryInfo) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMappingInfo(
	IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo> newMap
)
```
```vb
Public Sub SetMappingInfo (
	newMap As IDictionary(Of ExportIFCCategoryKey, ExportIFCCategoryInfo)
)
```
```cpp
public:
void SetMappingInfo(
	IDictionary<ExportIFCCategoryKey^, ExportIFCCategoryInfo^>^ newMap
)
```
```fsharp
member SetMappingInfo :
        newMap : IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo> -> unit
```

#### Parameters

newMap IDictionaryExportIFCCategoryKey, ExportIFCCategoryInfo

#### Reference

IFCCategoryTemplate Class

SetMappingInfo Overload

Autodesk.Revit.DB Namespace